Repository: HearMate/hear-mate-app
Catalog: lib/l10n/app_*.arb
Languages: de, pl, uk

# menu_about
source: About
de: Über
uk: Про застосунок

# menu_settings
source: Settings
de: Einstellungen
uk: Налаштування

# about_hearmate
source: HearMate is an application that supports preliminary hearing analysis, enabling users to obtain initial results and assess whether there is a need for consultation with a specialist. Its goal is to prevent situations in which hearing loss is detected too late, hindering effective treatment or negatively affecting quality of life. The application leverages artificial intelligence mechanisms to analyze audiograms and support the initial diagnostic process.
de: HearMate ist eine Anwendung, die eine erste Analyse des Hörvermögens unterstützt und es den Nutzern ermöglicht, erste Ergebnisse zu erhalten und zu beurteilen, ob eine Konsultation mit einem Spezialisten erforderlich ist. Ziel ist es, Situationen zu vermeiden, in denen ein Hörverlust zu spät erkannt wird, was eine wirksame Behandlung erschwert oder die Lebensqualität beeinträchtigt. Die Anwendung nutzt Mechanismen der künstlichen Intelligenz, um Audiogramme zu analysieren und den ersten Diagnoseprozess zu unterstützen.
uk: HearMate — це застосунок, який підтримує попередній аналіз слуху, дозволяючи користувачам отримати початкові результати та оцінити, чи є потреба в консультації зі спеціалістом. Його мета — запобігти ситуаціям, коли втрату слуху виявляють надто пізно, що ускладнює ефективне лікування або негативно впливає на якість життя. Застосунок використовує механізми штучного інтелекту для аналізу аудіограм і підтримки початкового діагностичного процесу.

# about_echoparse
source: EchoParse is a dedicated module responsible for converting traditional audiograms—both in paper and graphical formats—into CSV files suitable for further data analysis. This module leverages solutions based on classical element detection methods, enabling the automatic recognition and processing of audiometric test results. EchoParse was developed in collaboration with the Institute of Physiology and Pathology of Hearing, providing essential support in the digitization and analysis of diagnostic outcomes.
de: EchoParse ist ein spezielles Modul zur Umwandlung traditioneller Audiogramme – sowohl in Papierform als auch als Grafik – in CSV-Dateien, die für die weitere Datenanalyse geeignet sind. Dieses Modul verwendet klassische Methoden der Elementerkennung, um eine automatische Erkennung und Verarbeitung von audiometrischen Testergebnissen zu ermöglichen. EchoParse wurde in Zusammenarbeit mit dem Institut für Physiologie und Pathologie des Hörens entwickelt und unterstützt die Digitalisierung und Analyse diagnostischer Ergebnisse.
uk: EchoParse — це спеціалізований модуль, який відповідає за перетворення традиційних аудіограм — як паперових, так і графічних — у CSV-файли, придатні для подальшого аналізу даних. Цей модуль використовує класичні методи розпізнавання елементів, що дозволяє автоматично виявляти та обробляти результати аудіометричних тестів. EchoParse було розроблено у співпраці з Інститутом фізіології та патології слуху й надає ключову підтримку в оцифруванні та аналізі діагностичних результатів.

# about_projectTeam
source: The Project Team:
de: Projektteam:
uk: Проєктна команда:

# homepage_button_helper
source: Please select a module to continue:
de: Wähle ein Modul, um fortzufahren:
pl: Wybierz moduł aby kontynuować:
uk: Виберіть модуль, щоб продовжити:

# homepage_button_audioTest
source: Audio Test Module
de: Hörtest
pl: Test słuchu
uk: Тест слуху

# homepage_button_moreModules
source: More Modules Coming Soon...
de: Weitere Module folgen bald...
pl: Więcej modułów wkrótce...
uk: Більше модулів скоро...

# echoparse_welcome_heading
source: Your audiogram in CSV!
de: Dein Audiogramm als CSV!
pl: Twój audiogram w CSV!
uk: Ваш аудіограм у CSV!

# echoparse_welcome_body
source: Convert your audiogram photos and files into easy to use, modern CSV documents.
de: Verwandle deine alten Audiogrammdateien und Bilder in moderne CSV-Dokumente.
pl: Zamień swoje stare pliki i zdjęcia audiogramów w nowoczesne dokumenty CSV.
uk: Перетворіть свої старі файли та зображення аудіограм у сучасні документи CSV.

# echoparse_welcome_mainButton
source: Let's go!
de: Los geht’s!
pl: Zaczynamy!
uk: Почнемо!

# echoparse_upload_appbarTitle
source: Upload
de: Hochladen
pl: Prześlij
uk: Завантаження

# echoparse_upload_headerUpload
source: Load your audiogram
de: Audiogramm hochladen
pl: Załaduj audiogram
uk: Завантажити аудіограму

# echoparse_upload_buttonHelper
source: Accepted formats: png, jpg
de: Akzeptierte Formate: png, jpg
pl: Akceptowane formaty: png, jpg
uk: Підтримувані формати: png, jpg

# echoparse_upload_buttonPick
source: Pick file
de: Datei auswählen
pl: Wybierz plik
uk: Вибрати файл

# echoparse_upload_buttonUpload
source: Upload
de: Hochladen
pl: Prześlij
uk: Завантажити

# echoparse_upload_savedFilesHeader
source: Saved files
de: Gespeicherte Dateien
pl: Ostatnie pliki
uk: Збережені файли

# echoparse_settings_appbar_title
source: Settings
de: Einstellungen
pl: Ustawienia
uk: Налаштування

# echoparse_settings_language_title
source: Language
de: Sprache
pl: Język
uk: Мова

# echoparse_collection_thanks_title
source: Thank you for using
de: Vielen Dank für die Nutzung
pl: Dziękujemy za użycie
uk: Дякуємо за використання

# echoparse_collection_choose_title
source: Choose your way.
de: Wähle deinen Weg.
pl: Wybierz swoją drogę.
uk: Обери свій шлях.

# echoparse_collection_parse_title
source: Parse new file.
de: Neue Datei verarbeiten.
pl: Przetwórz nowy plik.
uk: Обробити новий файл.

# echoparse_collection_modules_title
source: Go back to modules
de: Zurück zu den Modulen
pl: Wróć do modułów
uk: Повернутися до модулів

# hearing_test_test_page_title
source: Hearing Test
de: Hörtest
pl: Test słuchu
uk: Тест слуху

# hearing_test_test_page_instruction
source: Press and hold the button when you can hear the sound. Release when you can no longer hear it.
de: Kliknij gdy usłyszysz dźwięk.
pl: Przytrzymaj przycisk, gdy słyszysz dźwięk. Puść, gdy przestaniesz go słyszeć.
uk: Натисніть і тримайте кнопку, коли чуєте звук. Відпустіть, коли більше не чуєте.

# hearing_test_test_page_release
source: Release the button now.
de: Lass den Knopf jetzt los.
pl: Puść przycisk teraz.
uk: Відпустіть кнопку зараз.

# hearing_test_test_page_end
source: End Test Early
de: Test beenden
pl: Zakończ test
uk: Завершити тест

# hearing_test_test_page_button_label
source: PRESS
de: DRÜCKEN
uk: НАТИСНУТИ

# hearing_test_audiogram_chart_frequency
source: Frequency (Hz)
de: Frequenz (Hz)
pl: Częstotliwość (Hz)
uk: Частота (Гц)

# hearing_test_audiogram_chart_mild_loss
source: Mild loss
de: Leichter Hörverlust
pl: Lekki ubytek
uk: Легка втрата

# hearing_test_audiogram_chart_moderate_loss
source: Moderate loss
de: Mäßiger Hörverlust
pl: Umiarkowany ubytek
uk: Помірна втрата

# hearing_test_audiogram_chart_severe_loss
source: Severe loss
de: Starker Hörverlust
pl: Znaczny ubytek
uk: Сильна втрата

# hearing_test_audiogram_chart_left_ear
source: Left ear
de: Linkes Ohr
pl: Lewe ucho
uk: Ліве вухо

# hearing_test_audiogram_chart_right_ear
source: Right ear
de: Rechtes Ohr
pl: Prawe ucho
uk: Праве вухо

# hearing_test_audiogram_chart_left_ear_masked
source: Left ear (masked)
de: Linkes Ohr (maskiert)
uk: Ліве вухо (з маскуванням)

# hearing_test_audiogram_chart_right_ear_masked
source: Right ear (masked)
de: Rechtes Ohr (maskiert)
uk: Праве вухо (з маскуванням)

# hearing_test_audiogram_chart_masking_explanation
source: Masking was detected in your hearing test result. It isolates the test ear by playing noise in the other ear to ensure accurate results.
de: Bei Ihrem Hörtest wurde eine Maskierung verwendet. Dabei wird das zu testende Ohr isoliert, indem im anderen Ohr ein Rauschen abgespielt wird, um genaue Ergebnisse zu gewährleisten.
uk: Під час вашого тесту слуху було використано маскування. Воно полягає у ізоляції тестованого вуха шляхом відтворення шуму в іншому вусі для забезпечення точності результатів.

# hearing_test_result_page_your_results
source: Your Hearing Test Results
de: Deine Hörtestergebnisse
pl: Twoje wyniki testu słuchu
uk: Ваші результати тесту слуху

# hearing_test_result_page_instruction
source: Below is your audiogram showing hearing thresholds across different frequencies.
de: Unten siehst du dein Audiogramm mit den Hörschwellen bei verschiedenen Frequenzen.
pl: Poniżej znajduje się Twój audiogram przedstawiający progi słyszenia dla różnych częstotliwości.
uk: Нижче наведено вашу аудіограму, що показує пороги слуху на різних частотах.

# hearing_test_result_page_note
source: Note
de: Hinweis
pl: Uwaga
uk: Примітка

# hearing_test_result_page_note_description
source: This generated audiogram and hearing test results are not precise and should be interpreted with caution. For an accurate diagnosis, please consult a qualified audiologist or healthcare professional.
de: Dieses generierte Audiogramm und die Hörtestergebnisse sind Näherungswerte und sollten nicht als medizinische Diagnose betrachtet werden. Für genaue Ergebnisse wende dich bitte an einen qualifizierten Audiologen oder Arzt.
pl: Wygenerowany audiogram i wyniki testu mają charakter orientacyjny i nie są dokładne. Skonsultuj się z wykwalifikowanym specjalistą, aby uzyskać rzetelną diagnozę.
uk: Ця згенерована аудіограма та результати тесту слуху є приблизними та не повинні сприйматися як точна діагностика. Для достовірних результатів зверніться до кваліфікованого аудіолога або лікаря.

# hearing_test_result_page_save_results
source: Save results
de: Ergebnisse speichern
pl: Zapisz wyniki
uk: Зберегти результати

# hearing_test_result_page_home
source: Back to home
de: Zurück zur Startseite
pl: Powrót do strony głównej
uk: Повернутися на головну

# hearing_test_result_page_save_results_missing_values_title
source: Incomplete Test
de: Unvollständiger Test
uk: Неповний тест

# hearing_test_result_page_save_results_missing_values_prompt
source: Some test results are missing. Are you sure you want to save anyway?
de: Einige Testergebnisse fehlen. Möchten Sie trotzdem speichern?
uk: Деякі результати тесту відсутні. Ви впевнені, що хочете зберегти?

# hearing_test_result_page_save_results_missing_values_save_anyway
source: Save Anyway
de: Trotzdem speichern
uk: Зберегти все одно

# hearing_test_result_page_save_results_success_message
source: Your results have been successfully saved.
de: Ihre Ergebnisse wurden erfolgreich gespeichert.
uk: Ваші результати успішно збережено.

# hearing_test_result_page_save_results_on_exit_prompt
source: Do you want to save your hearing test results before exiting?
de: Möchten Sie Ihre Hörtestergebnisse vor dem Beenden speichern?
uk: Бажаєте зберегти результати слухового тесту перед виходом?

# hearing_test_result_page_already_saved_title
source: Already Saved
de: Bereits gespeichert
uk: Вже збережено

# hearing_test_result_page_already_saved_message
source: You’ve already saved these results.
de: Sie haben diese Ergebnisse bereits gespeichert.
uk: Ви вже зберегли ці результати.

# hearing_test_incomplete
source: Your hearing test isn’t complete, so we can’t show a full summary.
de: Ihr Hörtest ist noch nicht vollständig, daher können wir noch keine vollständige Zusammenfassung anzeigen.

# hearing_test_summary_intro
source: Here’s a quick summary of your hearing test:
de: Hier ist eine kurze Zusammenfassung Ihres Hörtests:

# hearing_test_ear_left
source: Left ear
de: Linkes Ohr

# hearing_test_ear_right
source: Right ear
de: Rechtes Ohr

# hearing_test_classification_normal_hearing
source: normal hearing
de: normales Hören

# hearing_test_classification_mild
source: mild hearing loss
de: leichter Hörverlust

# hearing_test_classification_moderate
source: moderate hearing loss
de: mittlerer Hörverlust

# hearing_test_classification_severe
source: severe hearing loss
de: starker Hörverlust

# hearing_test_classification_profound
source: profound hearing loss
de: sehr starker Hörverlust

# hearing_test_symmetry_symmetrical
source: Hearing looks similar in both ears (symmetrical).
de: Ihr Hören wirkt in beiden Ohren ähnlich (symmetrisch).

# hearing_test_symmetry_asymmetrical
source: There are noticeable differences between your ears (asymmetrical).
de: Zwischen Ihren Ohren bestehen merkliche Unterschiede (asymmetrisch).

# hearing_test_high_freq_both
source: High‑frequency hearing loss is present in both ears.
de: Ein Hörverlust im Hochfrequenzbereich liegt in beiden Ohren vor.

# hearing_test_high_freq_left
source: High‑frequency hearing loss is present in the left ear.
de: Ein Hörverlust im Hochfrequenzbereich liegt am linken Ohr vor.

# hearing_test_high_freq_right
source: High‑frequency hearing loss is present in the right ear.
de: Ein Hörverlust im Hochfrequenzbereich liegt am rechten Ohr vor.

# hearing_test_low_freq_both
source: Low‑frequency hearing loss is present in both ears.
de: Ein Hörverlust im Tieffrequenzbereich liegt in beiden Ohren vor.

# hearing_test_low_freq_left
source: Low‑frequency hearing loss is present in the left ear.
de: Ein Hörverlust im Tieffrequenzbereich liegt am linken Ohr vor.

# hearing_test_low_freq_right
source: Low‑frequency hearing loss is present in the right ear.
de: Ein Hörverlust im Tieffrequenzbereich liegt am rechten Ohr vor.

# hearing_test_welcome_page_welcome
source: Welcome to Hearing Test
de: Willkommen zum Hörtest
pl: Witamy w teście słuchu
uk: Ласкаво просимо до тесту слуху

# hearing_test_welcome_page_description
source: This module will test your hearing ability across different frequencies.
de: Dieses Modul testet dein Hörvermögen bei verschiedenen Frequenzen.
pl: Ten moduł przetestuje Twój słuch w różnych częstotliwościach.
uk: Цей модуль протестує ваш слух на різних частотах.

# hearing_test_welcome_page_start_hearing_test
source: Start Test
de: Test starten
uk: Почати тест

# hearing_test_welcome_page_disclaimer_title
source: Disclaimer
de: Haftungsausschluss

# hearing_test_welcome_page_disclaimer
source: This is not a medical grade product. It is intended to be used only with Sony WH-1000XM5 headphones, with noise cancelling turned on and volume set to maximum, equalizer shall not be used.
de: Dies ist kein medizinisches Produkt. Es ist ausschließlich für die Verwendung mit Sony WH-1000XM5-Kopfhörern vorgesehen, mit eingeschaltetem Geräuschunterdrückung und maximaler Lautstärke, ohne Equalizer.

# hearing_test_delete_alert_title
source: Delete Result
de: Ergebnis löschen
uk: Видалити результат

# hearing_test_delete_alert_message
source: Are you sure you want to permanently delete this result? This action cannot be undone.
de: Möchten Sie dieses Ergebnis wirklich dauerhaft löschen? Diese Aktion kann nicht rückgängig gemacht werden.
uk: Ви впевнені, що хочете остаточно видалити цей результат? Цю дію не можна скасувати.

source: Cancel
de: Abbrechen
uk: Скасувати

source: Delete
de: Löschen
uk: Видалити

source: Save
de: Speichern
uk: Зберегти

source: Success
de: Erfolg
uk: Успіх

source: No
de: Nein
uk: Ні

# error_message
source: Error: {error}
de: Fehler: {error}
uk: Помилка: {error}

# hearing_test_history_page_result_info
source: Left: {left} Right: {right}
de: Links: {left} Rechts: {right}
uk: Ліве: {left} Праве: {right}

# hearing_test_result_history_page
source: Result history
de: Ergebnisverlauf
uk: Історія результатів

source: Ok
uk: Гаразд
